tests/regression_tests/expression_bdd_dot_dark/simple_expression.dot
digraph bdd {
  rankdir=TB;
  bgcolor="#202124";
  "node000" [label = "a", fillcolor = "#2e2e2e", fontcolor = "#e8eaed", name = "node000", shape = "circle", style = "filled"];
  "node001" [label = "b", fillcolor = "#2e2e2e", fontcolor = "#e8eaed", name = "node001", shape = "circle", style = "filled"];
  "node002" [label = "c", fillcolor = "#2e2e2e", fontcolor = "#e8eaed", name = "node002", shape = "circle", style = "filled"];
  "node003" [label = "d", fillcolor = "#2e2e2e", fontcolor = "#e8eaed", name = "node003", shape = "circle", style = "filled"];
  "node004" [label = "0", fillcolor = "lightgray", name = "node004", shape = "box", style = "filled"];
  "node005" [label = "1", fillcolor = "lightgray", name = "node005", shape = "box", style = "filled"];
  "node000" -> "node001" [style = "solid"];
  "node000" -> "node002" [style = "dashed"];
  "node001" -> "node002" [style = "dashed"];
  "node001" -> "node005" [style = "solid"];
  "node002" -> "node003" [style = "solid"];
  "node002" -> "node004" [style = "dashed"];
  "node003" -> "node004" [style = "dashed"];
  "node003" -> "node005" [style = "solid"];
}
